import streamlit as st
import pandas as pd
import matplotlib.pyplot as plt
from sklearn.linear_model import LinearRegression
from sklearn.model_selection import train_test_split
from sklearn.metrics import mean_squared_error, r2_score
import numpy as np
from numpy.random import default_rng as rng


st.title("🚮Sustainable waste management dataset 2024")
st.write("การจัดการของเสีย (Waste Management) คือกระบวนการที่เกี่ยวข้องกับการจัดการขยะหรือของเสียตั้งแต่จุดเริ่มต้นของการเกิดของเสีย ไปจนถึงขั้นตอนสุดท้ายของการกำจัดอย่างถูกต้องและปลอดภัย โดยมีเป้าหมายหลักเพื่อลดผลกระทบต่อสิ่งแวดล้อม สุขภาพของมนุษย์ และชุมชน รวมถึงการใช้ทรัพยากรอย่างคุ้มค่าและยั่งยืน การจัดการของเสียที่มีประสิทธิภาพจึงถือเป็นองค์ประกอบสำคัญของการพัฒนาที่ยั่งยืนในทุกภาคส่วน ไม่ว่าจะเป็นภาคครัวเรือน อุตสาหกรรม หรือองค์กรต่าง ๆกระบวนการจัดการของเสียเริ่มตั้งแต่การลดการเกิดของเสีย (Reduce) ซึ่งเป็นขั้นตอนที่สำคัญที่สุด โดยมุ่งเน้นการใช้ทรัพยากรเท่าที่จำเป็น เลือกใช้วัสดุที่สามารถนำกลับมาใช้ซ้ำได้ และหลีกเลี่ยงการใช้วัสดุที่ก่อให้เกิดขยะจำนวนมาก ขั้นตอนถัดมาคือการนำกลับมาใช้ซ้ำ (Reuse) เช่น การนำบรรจุภัณฑ์หรือวัสดุต่าง ๆ มาใช้ใหม่โดยไม่ต้องผ่านกระบวนการแปรรูป และการรีไซเคิล (Recycle) ซึ่งเป็นการนำของเสียที่ยังมีคุณค่าไปผ่านกระบวนการแปรรูปเพื่อกลับมาใช้ประโยชน์อีกครั้งนอกจากนี้ การคัดแยกขยะตั้งแต่ต้นทางยังเป็นหัวใจสำคัญของการจัดการของเสีย โดยสามารถแบ่งของเสียออกเป็นหลายประเภท เช่น ขยะทั่วไป ขยะรีไซเคิล ขยะอินทรีย์ และขยะอันตราย การคัดแยกที่ถูกต้องจะช่วยลดปริมาณขยะที่ต้องนำไปกำจัดขั้นสุดท้าย และช่วยให้การนำของเสียกลับมาใช้ประโยชน์เป็นไปอย่างมีประสิทธิภาพมากยิ่งขึ้น สำหรับของเสียที่ไม่สามารถนำกลับมาใช้ได้ จำเป็นต้องมีวิธีการกำจัดที่เหมาะสม เช่น การฝังกลบอย่างถูกสุขลักษณะ การเผาทำลายภายใต้การควบคุมมาตรฐาน หรือการบำบัดด้วยเทคโนโลยีที่เป็นมิตรต่อสิ่งแวดล้อมการจัดการของเสียที่ดีไม่เพียงแต่ช่วยลดมลพิษทางดิน น้ำ และอากาศ แต่ยังช่วยลดการปล่อยก๊าซเรือนกระจก อนุรักษ์ทรัพยากรธรรมชาติ และส่งเสริมคุณภาพชีวิตของประชาชนในระยะยาว ดังนั้น การสร้างความตระหนักรู้และความร่วมมือจากทุกภาคส่วน ทั้งภาครัฐ ภาคเอกชน และประชาชน จึงเป็นสิ่งจำเป็น เพื่อให้การจัดการของเสียเป็นไปอย่างมีประสิทธิภาพและนำไปสู่สังคมที่สะอาด ปลอดภัย และยั่งยืนในอนาคต")
CSV_FILE = "sustainable_waste_management_dataset_2024.csv"
df = pd.read_csv(CSV_FILE)
if st.button("View DataBase"):
    st.dataframe(df)
st.button("Close DataBase",type= "primary")
selected_features = ['recyclable_kg','organic_kg','temp_c','rain_mm','collection_capacity_kg']
X = df[selected_features]
y = df['waste_kg']

df_combined = pd.concat([X, y], axis=1)
df_combined.dropna(inplace=True)

X = df_combined[selected_features]
y = df_combined['waste_kg']


X_train, X_test, Y_train, Y_test = train_test_split(X, y, test_size=0.2, random_state=30)

model = LinearRegression()

model.fit(X_train, Y_train)

Y_pred = model.predict(X_test)

print("MSE: ", mean_squared_error(Y_test, Y_pred))
print("R squared: ", r2_score(Y_test, Y_pred))


plt.figure(figsize=(10, 6))
plt.scatter(Y_test, Y_pred, alpha=0.7)
plt.plot([y.min(), y.max()], [y.min(), y.max()], '--', color='red', lw=2, label='Perfect Prediction Line')
plt.xlabel('Actual Waste_kg (Y_test)')
plt.ylabel('Predicted Waste_kg (Y_pred)')
plt.title('Predicted Waste vs. Actual Waste')
plt.legend()
plt.grid(True)
plt.show()

fig, ax = plt.subplots()
ax.scatter(Y_test, Y_pred, alpha=0.7)
ax.plot([y.min(), y.max()], [y.min(), y.max()], '--', color='red', lw=2, label='Perfect Prediction Line')
ax.set_xlabel('Actual Waste_kg (Y_test)')
ax.set_ylabel('Predicted Waste_kg')
ax.set_title('Predicted Waste vs. Actual Waste')
ax.legend()
ax.grid(True)
if st.button("View Graph"):
    st.pyplot(fig)
st.button("Close Graph",type= "primary")
st.write('หากต้องการดาวน์โหลดไฟล์CSVคลิกปุ่มข้างล่าง')
csv_data = df.to_csv(index=False).encode('utf-8')
st.download_button(
label="Download CSV",
data=csv_data,
file_name="data.csv",
mime="text/csv"
)

with open("style.css") as f:
    st.markdown(f"<style>{f.read()}</style>", unsafe_allow_html=True)